/* Задача 10: Напишите программу, которая принимает на
вход трёхзначное число и на выходе показывает вторую
цифру этого числа.
456 -> 5
782 -> 8
918 -> 1
*/
/* int a = 587;

if (a < 100 || a > 999)
{
    Console.Write("Не трехзначное число");
}
else
{
    a = a % 100;
    Console.Write(a / 10); 
} */

///////////////////// */
/* Задача 15: Напишите программу, которая принимает на
вход цифру, обозначающую день недели, и проверяет,
является ли этот день выходным.
6 -> да
7 -> да
1 -> нет */

/* int a=1;

if (a>7 || a<1)
{
    Console.Write("Число не является днем недели");
}
else if (a<=5)
{
    Console.Write ("Не выходной");
}
else
{
    Console.Write ("Выходной");
} */

